driver-tests/bpelse/assign/AssignJbi/src/jbiServiceUnits/AssignBpel/IgnoreMissingFromData/testWsdl.wsdl

<?xml version="1.0" encoding="windows-1252"?>
<definitions name="testWsdl" targetNamespace="http://j2ee.netbeans.org/assign/AssignBPEL/IgnoreMissingFromData/wsdl/testWsdl"
    xmlns="http://schemas.xmlsoap.org/wsdl/"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://j2ee.netbeans.org/assign/AssignBPEL/IgnoreMissingFromData/wsdl/testWsdl" xmlns:ns="http://xml.netbeans.org/assign/AssignBPEL/IgnoreMissingFromData/schema/schema1" xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/assign/AssignBPEL/IgnoreMissingFromData/wsdl/testWsdl">
            <xsd:import namespace="http://xml.netbeans.org/assign/AssignBPEL/IgnoreMissingFromData/schema/schema1" schemaLocation="schema1.xsd"/>
        </xsd:schema>
    </types>
    <message name="testWsdlOperationRequest">
        <part name="In1" type="ns:Input"/>
        <part name="In2" type="xsd:string"/>
    </message>
    <message name="testWsdlOperationResponse">
        <part name="Return" type="xsd:string"/>
    </message>
    <portType name="testWsdlPortType">
        <operation name="testWsdlOperation">
            <input name="input1" message="tns:testWsdlOperationRequest"/>
            <output name="output1" message="tns:testWsdlOperationResponse"/>
        </operation>
    </portType>
    <binding name="testWsdlBinding" type="tns:testWsdlPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="testWsdlOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/assign/AssignBPEL/IgnoreMissingFromData/wsdl/testWsdl"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="http://j2ee.netbeans.org/assign/AssignBPEL/IgnoreMissingFromData/wsdl/testWsdl"/>
            </output>
        </operation>
    </binding>
    <service name="testWsdlService">
        <port name="testWsdlPort" binding="tns:testWsdlBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/testWsdlService/testWsdlPort"/>
        </port>
    </service>
    <plnk:partnerLinkType name="testWsdl">
        <!-- A partner link type is automatically generated when a new port type is added. Partner link types are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plnk:role name="testWsdlPortTypeRole" portType="tns:testWsdlPortType"/>
    </plnk:partnerLinkType>
</definitions>
