driver-tests/bpelse/assign/AssignJbi/test/IgnoreMissingFromData1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tes="http://j2ee.netbeans.org/assign/AssignBPEL/IgnoreMissingFromData/wsdl/testWsdl" xmlns:sch="http://xml.netbeans.org/assign/AssignBPEL/IgnoreMissingFromData/schema/schema1">
  <soapenv:Body>
    <tes:testWsdlOperation>
      <In1>
        <sch:Id>String1</sch:Id>
        <sch:Data>String2</sch:Data>
      </In1>
      <In2>case1</In2>
    </tes:testWsdlOperation>
  </soapenv:Body>
</soapenv:Envelope>